OdGeVector3d.orthoProject(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.ErrorCondition*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns a 3D vector which is the result of the orthogonal projection of this vector into the plane with normal planeNormal passing through the origin.
\param planeNormal [in]  A 3D vector which is a normal vector of a plane on which this vector is projected.
\param tol [in]  Geometric tolerance.
\param flag [in]  A flag that displays if method executed successfully.
\remarks
The flag is set to kOk value if method executed successfully, otherwise it is set to k0This value.

OdGeVector3d.setLength(System.Double)
\details
Sets the length of this vector.

OdGeVector3d.angleTo(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the angle to the specified vector.
\param vect [in]  Any 3D vector.
\remarks
If refVector is not specified:
* Returns a value in the range [0.0 .. OdaPI].
* This function is commutative.

OdGeVector3d.op_UnaryNegation
\details
Returns a vector with inverted X, Y and Z coordinates.

OdGeVector3d.convert2d
\details
Returns the 2D vector, in the coordinate system
of the plane, corresponding to the 3D vector.
\remarks
The 3D vector must be parallel to the plane.
If no plane is specified, the XY plane is used.

OdGeVector3d.convert2d(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the 2D vector, in the coordinate system
of the plane, corresponding to the 3D vector.
\remarks
The 3D vector must be parallel to the plane.
If no plane is specified, the XY plane is used.